<template>
    <div class="main">
        <mu-appbar :title="'当前页：'+index" class="appBar">
            <mu-icon-button icon="arrow_back_ios" slot="left" @click="swipeRight" />
    
        </mu-appbar>
        <pageLayout class="page" :index="index" :height="height" :width="width" :indexChange="indexChange">
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>江五月眉头紧蹙，“会吗？可是，我自己感觉很好啊！在我的感觉中，我的防御明明是应该变强了才对，怎么会减弱呢？” 唐舞麟耸了耸肩膀，“这我就不知道了。不过，这可是大问题，在战网中无所谓，要是在面对深渊生物的时候你身上出问题，那可就麻烦了。事关生死啊！要不我们再进去，你好好感觉一下自己的防御变化？” 江五月立刻点了点头，有些紧张的道：“好，我们再试试，这次你慢一点，不要急着攻击我。” 两人又一次进入了比赛台。 当江五月反手用自己的巨锤狠狠的砸了一下胸膛，感受着自身防御以及斗铠防御力的时候，他眼中的紧张顿时消失了。 “没有啊！我防御很正常啊！你看看，刚才这一锤起码有几万斤，一点问题都没有。哈哈，我就说嘛，我自己没什么事儿。再来，我就不信了……” 一分钟后！ “唐！舞！麟！”江五月气急败坏的看着在自己后面出来的唐舞麟，“不对、不对，你的枪有鬼。你的力量也不对。这次我的锤子砸到你那黄金龙枪上了，怎么一下就被弹飞了，而且还在我锤子上留下了那么深的痕迹。我的防御力对你的黄金龙枪根本就没用，跟热刀切牛油似的。到底怎么回事？” 唐舞麟眨了眨眼睛，刚要开口，江五月就继续说道：“别跟我说你也不知道啊！我才不信你不知道呢。你这家伙，一肚子坏水。你肯定一开始就知道是怎么回事儿。不是战网的问题对不对？是你的能力有什么进化了。” 江五月虽然憨直了一些，但能够走到今天这一步，也绝不是笨蛋。在数次尝试，尤其是在他刻意观察之后，终于明白自己上了唐舞麟的当。这家伙，从一开始就知道是怎么回事儿，却诱骗着自己一次又一次的给他当靶子。 但同样的，他心中也大为震惊，以自己的防御力，在魂帝而这个层次已经绝对是巅峰中的巅峰了。可这唐舞麟的攻击力，居然能让自己的防御完全无效。这就算是魂圣和一般的魂斗罗也做不到啊！尤其是一开始的秒杀，就算是自己估计不足，那也要他的攻击力足够恐怖才行。 这些都是江五月完全无法理解的，可事实摆在眼前。 唐舞麟一脸无奈的道：“没有啊！我也不知道是怎么回事。我是有点突破，但我也不懂为什么会一下差了这么多。应该是你变弱了吧？”
    
                </p>
            </div>
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>“你少来这套，我魂力旋涡已成，未来必成魂核。怎么可能是变弱了。”江五月怒道。 唐舞麟顿时脸色一变，得意洋洋的道：“那就是我变强了。你也不用这么色厉内荏的模样。怕了就是怕了，没什么好不承认的。没事儿，我不会歧视你的，我们还是朋友。” “谁怕了？我才没怕。只是不熟悉你变化后的能力。”江五月怒道。 “切，你都不敢跟我打了，还不是怕？都打了好几次了，那你现在适应了吧。还敢不敢再来？”唐舞麟一脸骄傲的模样。 “来就来！我还就不信了我。你出钱！” “好。”唐舞麟毫不犹豫的答应一声，两人就又进了比赛台。 两分钟后。 光影一闪，身体晃动着江五月就出来了，骇然之色从脸上一闪而过。 唐舞麟随后出现，得意洋洋的道：“就说了你不行吧。这是差距！”一边说着，他还朝着江五月比了比手臂上的肌肉。 “不可能！我就不信了，再来！” 又是两分钟后…… “再来！” 再次两分钟后…… “不打了！” 江五月一脸挫败的看着面前的唐舞麟。如果说，一次是失误，两次是大意，那么，三次、五次呢？还是失误？ 这家伙简直就是个怪物，无论是力量、攻击、速度、防御，任何一个方面都已经远远凌驾在自己智商。他那黄金龙枪怎么看都不该是重武器，可是，就算是和自己的巨锤硬碰硬，也能把自己震飞。然后自己那一身引以为傲的防御，根本就不能给他造成任何麻烦，只要一次机会，自己的身体就会被直接贯穿。 更可怕的是唐舞麟的枪意，当他那枪意释放出来的时候，江五月立刻就会感觉到如同透心凉一般，全身仿佛都被穿刺的通透了。 面对这样的对手，他虽然战意强大，但挫败感是会累积的啊！继续再这样下去，他的信心就会彻底动摇了。哪还愿意和唐舞麟继续打下去。
    
                </p>
            </div>
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>没事儿吧，五月？”唐舞麟一脸关切的来到他身边。 “你走开！”江五月喘息几声，好不容易从之前的痛苦中恢复过来。 唐舞麟叹息一声，“我也不知道会这样，原来我竟然已经如此强大了吗？五月，对不起，我知道，过大的差距会让你自卑，可我真不想这样。没事儿，不要自卑，继续努力。” “谁自卑了？你才自卑！”江五月的暴脾气又忍不了了。 唐舞麟耸了耸肩膀，“你都不敢继续了，不是自卑是什么？” “谁说我不敢继续了？”江五月顿时瞪大了眼睛，但在下一瞬，他的眼神却突然变得平和了，哼了一声，道：“少来这套，我不会再上你当了。你这家伙太坏了，又想用激将法激我。我才不上当呢。” 唐舞麟耸耸肩，“随你好了。本来我想给你个恢复自信的机会，下一场不用斗铠呢。既然你不需要，那就算了。走吧。出去了。” “等等！你说的？不用斗铠？”江五月一把拉住唐舞麟。 “是啊！”唐舞麟一脸恳切的道：“总要给你点恢复自信的机会。不过算了，看你样子，你也没怎么气馁。我还省得被你揍呢。” “别啊！舞麟，你是好人。来、来、来，再来一场。这次，我来付钱！” 再次进入比赛台，两人相对而立，唐舞麟脸上已经流露出了微笑。 江五月目光灼灼的看着他，“说话算数啊！不能用斗铠啊！” “当然！”唐舞麟向他点了点头。 “三、二、一，开始！” 伴随着电子音一声开始，江五月再次释放出武魂、斗铠，把力量提升到巅峰。 看着他，唐舞麟心中不禁暗暗赞叹，如果换了是其他的对手，他绝不会这么激对方，持续战斗。尽管他很需要一个强大的对手来感受自己现在的实力。 但江五月不一样，这家伙的战意绝对是唐舞麟见过的人中最强悍的一个。而且神经极为大条，心理素质那绝不是一般的好。当真是越挫越勇。 唐舞麟果然没有释放斗铠，黄金龙枪横在身侧，四圈金色光环从脚下升起，围绕在身体周围。 第一圈金色光环亮起，赫然正是黄金龙体。金色鳞片覆盖全身，虽然没有斗铠增幅那么强烈，但这一刻，他全身的鳞片都散发出了淡淡的白金色光芒。
    
                </p>
            </div>
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>江五月没好气的道：“你以为谁都是你们血神营啊！每个人都有一台星斗舱。你知道我有多嫉妒吗？我要是攒够了功勋，就去买一台。只是太贵了，要八千功勋，舍不得啊！” 唐舞麟笑道：“那你就忍着吧，排队好了。走吧，废话少说，先打一场。” 江五月冷哼一声，“这次非要揍得你满地找牙。我可跟你说，前几天军团不知道怎么引动了庞大的生命能量那次，我可是有了质的飞跃。巨大突破哦。我的魂力旋涡形成了。有魂力旋涡支持，我的霸王龙力量会几何倍数提升，再也不用担心后力不足的问题。你等着看，嘿嘿！” 唐舞麟只是笑笑，一脸人畜无害的模样道：“好啊！我就不怕被揍，挨打中才能成长。” 江五月道：“走！” 两人付了两千联邦币，光芒一闪，进入比赛场地之中。 江五月显然也是因为突破而大为兴奋，憋着劲呢，电子音的开始刚一出声，他就立刻释放出了自己的斗铠和武魂。 暗金色光芒席卷全身，唐舞麟甚至隐约能够看到，在他身前有一团浓烈的暗金色旋涡光晕出现。 伴随着那旋涡的绽放，江五月的身体直接就膨胀到了八米高，厚重的二字斗铠附体。强横无比的气息顿时从体内爆发开来。 魂力旋涡在他的控制下急速旋转，恐怖的力量波动甚至震荡的他身体周围的空气都出现了丝丝破碎的痕迹。 江五月有些得意的道：“我形成魂力旋涡可和其他人不一样，我这魂力旋涡一成，因为身体承受能力强，旋转速度至少是普通魂师的三倍。提供给我的能量就极其庞大，更是直接注入力量之中。我的力量成长也就是三倍，别看你以前有力气，这次，你一定比不过我。” “来吧！”唐舞麟微微一笑，身上金光闪烁，二字斗铠附体，面具落下，发出清脆的铿锵声，同时黄金龙枪入手，长枪在身边一甩，前端枪尖就绽放出七尺白金色枪芒。 怒吼一声，江五月大踏步的就朝着唐舞麟冲了过来，双手一身，一双巨锤入手，巨锤抡起，浓烈的暗金色光芒瞬间爆发，就像是两颗小流星一般，直奔唐舞麟就砸了过来。 他没有吹牛，他双锤上的力量足足激增了三倍以上，威力之恐怖，就算是三字斗铠师也未必愿意正面硬抗。 唐舞麟双眼微眯，全身斗铠升腾着淡淡的金色光晕，下一瞬，他动了。 背后一双龙翼骤然收敛，当他脚尖在地面上点动的时候，全身仿佛突然变亮了。背后翅膀只是轻微的拍动了一下，下一瞬，江五月看到的，就是一道流光。 一种难以形容的锋锐感一闪而过。双锤的力量仿佛顷刻间就消散了，就连他那急速旋转的魂力旋涡也出现了短暂的停顿。 从始至终，江五月看到的，就只是那一点白金色光芒闪过。然后唐舞麟就消失的无影无踪。 然后，紧接着他就发现，自己的魂力旋涡不受控制了。 “轰——”剧烈的爆炸声中，江五月的身体在惨叫中消失。
    
                </p>
            </div>
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>唐舞麟身上的金色光焰，直到此时才悄然收歇。化为白金色的黄金龙枪，晶莹剔透宛如实质的枪芒缓缓收敛。 在江五月爆炸之前的那一瞬，他那庞大的身体上，足足有一个直径一米的大洞穿过。哪怕是二字斗铠，也没能让这个伤口变小。 光影一闪，唐舞麟还没有过多的体会，他就已经从对战区出来了。 江五月正一脸错愕的站在那里，就像唐舞麟没有完全体会战斗中自己的能量变化一样，此时的江五月，也没有完全从之前突如其来的灭杀中清醒过来。 这都什么情况？他刚刚有了那么大的进步，怎么会一下就结束了？他甚至连自己身上的伤口都没看到。 “舞麟，你也出来了？怎么回事？是不是星斗战网出问题了？”江五月疑惑的看着唐舞麟。 唐舞麟眨了眨眼睛，“不知道啊！我这不也出来了？好像咱俩碰撞了一下，比赛就自行结束了。” 江五月眉头紧皱，“没听说星斗战网有问题啊！这要是出了问题，联邦麻烦可不小。走，我们再试试。”一边说着，这次他主动支付了两千联邦币，两人又一次进入到了对战区比赛台中。 光芒一闪，两人同时出现，电子音倒计时响起，和以前并没有什么区别。 “感觉上也没什么不同啊！可是，刚刚怎么会出现错误了呢？”江五月一头雾水的向唐舞麟说道。 唐舞麟道：“要不，咱们再试试？” 江五月点点头，“好，再来。”一边说着，他释放斗铠，释放武魂，六圈魂环升起，身体变大，一双巨锤握在双手之中，怒吼着就朝着唐舞麟冲了过来。 唐舞麟同样穿上斗铠，手持黄金龙枪。白金色的枪芒再次出现。有了之前的经验，他的精气神瞬间溶为一体，两大能量核心光芒璀璨，形成正反阴阳能量旋涡，白金色枪芒骤然暴增，当他起步向江五月冲去的时候，身上金芒明显变强。 之前那一场，他是借助了金龙九式中的金龙飞翔，增加了自己的速度。有正反旋涡支持，金龙飞翔威力大增，再加上无比锋锐的枪意，这才贯穿了江五月的身体。 而这一次，他索性没有动用金龙飞翔，就那么直接朝着江五月冲去，但当他双脚点地，骤然加速的时候，速度还是比以前快了一倍以上，几乎是一闪身，就到了江五月身前。 这次唐舞麟在认真的感受，当江五月双锤落下，即将命中自己身体的时候，他体内双核心同时光芒大放，在他身后，龙翼猛地一拍，二次加速。硬是从双锤之间穿梭而入，然后白金色枪芒就到了江五月暗金色的厚重甲胄之上。 霸王龙防御，加上二字斗铠，本身已经极其强悍了。可是，在那白金色枪芒面前，它们仿佛融化了一般悄无声息的顺着唐舞麟枪锋流淌。
    
                </p>
            </div>
            <div class="h" :style="{width:unitWidth,height:height}">
                <p>光影一闪，唐舞麟凭空落地。而这一次，因为没有金龙飞翔的加持，整个过程总算没有那么快了。至少让江五月感受到了剧烈的疼痛。当他低头看向自己，看到自己胸前的巨大孔洞时，电子音才随之响起。 “比赛结束，小唐胜。” 光影一闪，两人再次先后被传送出了比赛台。 对战区外，江五月瞪大了双眼，唐舞麟一脸人畜无害的模样。 “什么情况？刚才？好疼。你赢了我？”江五月总算是醒悟过一些来了。 唐舞麟眨了眨眼睛，“赢了吗？刚才结束的太快了，我还没什么感觉？怎么就赢了啊？” “是啊！怎么就赢了呢？”江五月也是满脸的不解，他心中最大的误区，就是没有朝着有同级别斗铠师能够一招秒掉自己，瞬间破开防御这方面想。所以，虽然这次感觉到了疼痛，他却依旧没有完全想明白。 唐舞麟一脸严肃的道：“看来，战网的问题还不小。我们必须要多试验几次，如果真的有问题，也好及时向军团上报。走，我们再试试，这次我出钱。” 看着唐舞麟好不容易大方一回，而且义正言辞的模样，江五月也就信了，两人又一次进了战网。 一分钟后，两人先后被传送出来。 “我去。太疼了。唐舞麟，怎么回事？你那白金色枪芒是怎么回事？这次我可是低头看到了，是你的黄金龙枪破开了我的身体，还在我身上炸了个洞。你这是什么情况？是不是利用了战网的漏洞？你这是耍赖啊！”江五月跳着脚说道。 唐舞麟嘴角牵动了一下，咳嗽一声，道：“没有啊！我怎么可能能够利用战网漏洞。这可是全联邦的科技结晶啊！是不是你自己出问题了？防御上有了问题，还是说你自身修炼出了问题，导致自身防御脆弱。”
    
                </p>
            </div>
        </pageLayout>
    
    </div>
</template>

<script>
export default {
    name: 'pageLayoutDemo',
    data() {
        return {
            width: $screen.width * 6 + 'px',
            unitWidth: $screen.width + 'px',
            height: $screen.height - 64 + 'px',
            index: 0
        }
    },
    methods: {
        indexChange: function (e) {
            this.index = e
        },
        next: function () {
            if (this.index < 6)
                this.index++
        },
        back: function () {
            if (this.index != 0)
                this.index--
        }, swipeRight: function () {
            this.$router.go(-1)
        }
    }
}
</script>

<style scoped>
.main {
    background: url('../asset/pageBg.png');
    width: 100%;
    height: 100%;
}

.page {
    position: absolute;
    width: 100%;
    top: 64px;
}

.appBar {
    position: absolute;
    width: 100%;
}

p {
    padding: 48px;
    line-height: 24px;
}

.shower {
    position: absolute;
    top: 424px;
}


.h {
    height: 400px;
    float: left;
}
</style>
